In [1]:
import pandas as pd
import numpy as np
from matplotlib import pyplot as plt
from scipy import stats as st
from math import factorial as ft 
import plotly.express as px
plt.style.use('ggplot')

In [2]:
df_demo = pd.read_excel('/Users/admin/Desktop/GitHub/new_repos/jackson-heights-analysis/jackson_heights_analysis.xlsx', sheet_name='demographics')
df_rent = pd.read_excel('/Users/admin/Desktop/GitHub/new_repos/jackson-heights-analysis/jackson_heights_analysis.xlsx', sheet_name='rent')
df_value = pd.read_excel('/Users/admin/Desktop/GitHub/new_repos/jackson-heights-analysis/jackson_heights_analysis.xlsx', sheet_name='value')
df_edu_inc = pd.read_excel('/Users/admin/Desktop/GitHub/new_repos/jackson-heights-analysis/jackson_heights_analysis.xlsx', sheet_name='education_income')

In [3]:
display(df_demo.head())
df_demo.info()

,year,occupied_units,available_units,population,minor_children,other_members,foreign_members,professional_head,managerial_head,owner_head,...,public_service_head,clerical_head,blue_collar_head,professional_other,managerial_other,owner_other,sales_other,public_service_other,clerical_other,blue_collar_other
0,1920,88,100,273,25,23,19,0.33,0.18,0.08,...,0.05,0.05,0.11,0.21,0.03,0.1,0.14,0.03,0.18,0.31
1,1930,86,100,230,33,18,24,0.28,0.15,0.09,...,0.08,0.15,0.09,0.16,0.05,0.0,0.08,0.21,0.29,0.21
2,1940,82,100,198,15,18,23,0.26,0.14,0.01,...,0.01,0.13,0.20,0.20,0.05,0.0,0.10,0.08,0.32,0.25
3,1950,100,100,184,7,14,22,0.30,0.09,0.00,...,0.05,0.21,0.23,0.12,0.05,0.0,0.05,0.08,0.58,0.12

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 21 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   year                  4 non-null      int64
 1   occupied_units        4 non-null      int64
 2   available_units       4 non-null      int64
 3   population            4 non-null      int64
 4   minor_children        4 non-null      int64
 5   other_members         4 non-null      int64
 6   foreign_members       4 non-null      int64
 7   professional_head     4 non-null      float64
 8   managerial_head       4 non-null      float64
 9   owner_head            4 non-null      float64
 10  sales_head            4 non-null      float64
 11  public_service_head   4 non-null      float64
 12  clerical_head         4 non-null      float64
 13  blue_collar_head      4 non-null      float64
 14  professional_other    4 non-null      float64
 15  managerial_other      4 non-null      float64
 16  owner_other           4 non-null      float64
 17  sales_other           4 non-null      float64
 18  public_service_other  4 non-null      float64
 19  clerical_other        4 non-null      float64
 20  blue_collar_other     4 non-null      float64
dtypes: float64(14), int64(7)
memory usage: 804.0 bytes

In [4]:
display(df_rent.head())
df_rent.info()

,year,rent_less_30,rent_30_34,rent_35_39,rent_40_44,rent_45_49,rent_50_54,rent_55_59,rent_60_64,rent_65_69,rent_70_84,rent_85_100,rent_80_84,rent_greater_100,rent_unknown
0,1930,NaN,NaN,NaN,7,NaN,NaN,1,1,4,6,2,NaN,1.0,NaN
1,1940,7.0,3.0,1.0,2,14.0,18.0,13,9,11,2,1,NaN,NaN,2.0

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 15 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   year              2 non-null      int64
 1   rent_less_30      1 non-null      float64
 2   rent_30_34        1 non-null      float64
 3   rent_35_39        1 non-null      float64
 4   rent_40_44        2 non-null      int64
 5   rent_45_49        1 non-null      float64
 6   rent_50_54        1 non-null      float64
 7   rent_55_59        2 non-null      int64
 8   rent_60_64        2 non-null      int64
 9   rent_65_69        2 non-null      int64
 10  rent_70_84        2 non-null      int64
 11  rent_85_100       2 non-null      int64
 12  rent_80_84        0 non-null      float64
 13  rent_greater_100  1 non-null      float64
 14  rent_unknown      1 non-null      float64
dtypes: float64(8), int64(7)
memory usage: 372.0 bytes

In [5]:
display(df_value.head())
df_value.info()

,year,value_2500,value_3000,value_3500,value_3500_2,value_4000,value_4500,value_5000,value_5500,value_6000,value_6500,value_7000,value_7500,value_8000
0,1940,5,5,14,3,6,7,2,7,5,5,5,2,2

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1 entries, 0 to 0
Data columns (total 14 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   year          1 non-null      int64
 1   value_2500    1 non-null      int64
 2   value_3000    1 non-null      int64
 3   value_3500    1 non-null      int64
 4   value_3500_2  1 non-null      int64
 5   value_4000    1 non-null      int64
 6   value_4500    1 non-null      int64
 7   value_5000    1 non-null      int64
 8   value_5500    1 non-null      int64
 9   value_6000    1 non-null      int64
 10  value_6500    1 non-null      int64
 11  value_7000    1 non-null      int64
 12  value_7500    1 non-null      int64
 13  value_8000    1 non-null      int64
dtypes: int64(14)
memory usage: 244.0 bytes

In [6]:
display(df_edu_inc.head())
df_edu_inc.info()

,who,eight_or_less,some_high_school,completed_high_school,some_college,completed_college,post_graduate,less_1000_income,1000_1999_income,2000_2499_income,2500_2999_income,3000_3499_income,3500_3999_income,4000_4499_income,4500_4999_income,5000_5499_income,unknown_other_income
0,head,14,8,37,7,20,4,2,22,15,9.0,4,1.0,4.0,4.0,5,16
1,other,32,22,46,13,17,1,16,13,4,NaN,1,NaN,NaN,NaN,2,xx

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 17 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   who                    2 non-null      object
 1   eight_or_less          2 non-null      int64
 2   some_high_school       2 non-null      int64
 3   completed_high_school  2 non-null      int64
 4   some_college           2 non-null      int64
 5   completed_college      2 non-null      int64
 6   post_graduate          2 non-null      int64
 7   less_1000_income       2 non-null      int64
 8   1000_1999_income       2 non-null      int64
 9   2000_2499_income       2 non-null      int64
 10  2500_2999_income       1 non-null      float64
 11  3000_3499_income       2 non-null      int64
 12  3500_3999_income       1 non-null      float64
 13  4000_4499_income       1 non-null      float64
 14  4500_4999_income       1 non-null      float64
 15  5000_5499_income       2 non-null      int64
 16  unknown_other_income   2 non-null      object
dtypes: float64(4), int64(11), object(2)
memory usage: 404.0+ bytes